<h1>
    Источники данных и Виджеты
</h1>
<hr />
<p>
    Одна из самых мощных возможностей Yii - это работа с данными. В Yii вы можете легко выводить данные непосредственно в представления, что является хорошим подходом для frontend интерфейса веб-сайта. Но когда дело доходит до backend компонентов и виджетов данных, то способность Yii, чтобы получить доступ к данным является реальной экономией времени.
</p>
<p>
    Как правило, вы должны предпринять следующие шаги при работе с одним из этих компонентов данных:
</p>
<ol>
    <li>Настройте data provider. Он может получать данные из массива, sql-запроса или AR-запроса и т.д.</li>
    <li>Передайте data provider в один из виджетов, таких как list view или grid view.</li>
    <li>Настройте виджет, чтобы отразить презентационный стиль, который вы хотите.</li>
</ol>
<p>
    Вот и все. После выполнения этих простых шагов вы будете иметь мощные интерфейсы, такие как полнофункциональная сетка данных, которая поддерживает разбиение на страницы, сортировку и фильтрацию, идеально подходит для администраторской части вашего проекта.
</p>