<h1>
    Что такое Yii
</h1>
<hr />
<p>
    Yii является высоко производительным фреймворком, на основе компонентов PHP для быстрой разработки крупномасштабных веб-приложений. Yii обеспечивает максимальную возможность многократного использования в веб-программировании и может значительно ускорить процесс разработки веб-приложений. Название Yii (произносится Yee или [ji:]) является аббревиатурой Yes It Is!.
</p>
<h2>
    Требования
</h2>
<hr />
<p>
    Для запуска Yii веб-приложения, вам нужен веб-сервер, поддерживающий PHP 5.4.0 или выше.
</p>
<p>
    Для разработчиков, которые хотят использовать Yii, знание объектно-ориентированного программирования (ООП) может быть очень полезным, так как Yii является чистым ООП-фреймворком. Yii 2.0 также использует новейшие функции PHP, такие как пространства имен, так что вы также должны быть знакомы с тем, как они работают.
</p>
<h2>
    Для чего Yii будет лучшим выбором?
</h2>
<hr />
<p>
    Yii главным образом является веб-фремворком, который может быть использован для разработки практически любого типа веб-приложения. Потому что он легкий и оснащенный сложными механизмами кэширования, Yii особенно подходит для приложений с высокой нагрузкой, таких как порталы, форумы, системы управления контентом (CMS), проектов для электронной коммерции, и так далее.
</p>
<h2>
    Как сравнить Yii с другими фреймворками?
</h2>
<ul>
    <li>Как и большинство PHP фреймворков, Yii использует MVC (Model-View-Controller) подход к проектированию.</li>
    <li>Yii является fullstack фреймворком, предоставляющим множество решений и компонентов, таких как ведение журнала, управление сессиями, кэширование и т.д.</li>
    <li>Yii обеспечивает хороший баланс между простотой и функциональностью.</li>
    <li>К синтаксису и общему удобству разработки команда разработчиков Yii относится серьезно.</li>
    <li>Производительность является одной из ключевых целей для фреймворка.</li>
    <li>Команда Yii разработчиков постоянно смотрит, как устроены другие веб-фреймворки, чтобы подсмотреть лучшие практики и функции, которые могут быть включены в Yii. Первый выпуск Yii находился под сильным влиянием Ruby on Rails. Тем не менее, никакая функциональность фреймворка слепо не копируется в Yii. Все решения основаны на том, что лучше для веб-разработчиков и соответстуют философии Yii.</li>
</ul>